/***************************************************************************************************
 *   Project:
 *   Author:        Stulov Tikhon
 ***************************************************************************************************
 *   Distribution:
 *
 ***************************************************************************************************
 *   MCU Family:    STM32F
 *   Compiler:      ARMCC
 ***************************************************************************************************
 *   File:          sett_def.h
 *   Description:   Этот модуль уникальный для каждого проекта
 *
 ***************************************************************************************************
 *   History:       07.06.2019 - file created
 *
 **************************************************************************************************/

#pragma once

/***************************************************************************************************
 *                                         INCLUDED FILES                                          *
 **************************************************************************************************/

#include "RTE_Components.h"
#include CMSIS_device_header

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include "sett_types.h"
#include "date.h"
#include "sett_work.h"

/***************************************************************************************************
 *                                         DEFINITIONS                                             *
 **************************************************************************************************/

/// Добавление строкового параметра, как BLOB поля
#define BLOB_STR_DATA(_name, _str) const char _name[sizeof(_str)] = {_str}
/// Добавление указателя на BLOB поле
#define BLOB_PTR(_type, _name) (offsetof(_type, _name) - offsetof(_type, vers) - sizeof(vers)), \
    sizeof(_name)

/***************************************************************************************************
 *                                          EXTERN VARS                                           *
 **************************************************************************************************/

/***************************************************************************************************
 *                                          PUBLIC TYPES                                           *
 **************************************************************************************************/

#pragma clang diagnostic push
// В этом участке кода подавляем предупреждение -Winvalid-offsetof. Оно возникает и-за того, что мы
// применяем метод offsetof к не-POD типам и его поведение может быть некорректно. Однако фактически
// все смещения вычисляются на этапе компиляции и некорректного поведения не обнаружено.
#pragma clang diagnostic ignored "-Winvalid-offsetof"

/**
 *  @brief      структура хранения параметров во flash
 *  @details    Уникальна для каждого устройства. Можно менять порядок произвольно за исключением
 *              vers. Этот параметр всегда и ОБЯЗАТЕЛЬНО располагается в конце структуры.
 */
__PACKED_STRUCT  params_users_t;
__PACKED_STRUCT  params_users_t: public params_base_t
{
    /**
     *  @brief      Ревизия пользовательских настроек
     *  @history    0x01 Стартовое значение
     *  @warning    Внимание!! Обязательный параметр в начале структуры
     */
    const param_uint8_t rev = {{PARAM_ID_REV, PARAM_ACCESS_RO, PARAM_DATA_1_BYTE}, 1};

    /*
    user settings
    */

    /**
     *  @brief      версия структуры
     *  @history    0x01 Стартовое значение
     *  @warning    Внимание!! Параметр всегда должен быть последним
     */
    const param_uint8_t vers = {{PARAM_ID_VERS, PARAM_ACCESS_RO, PARAM_DATA_1_BYTE}, 1};

private:
    // Blob-данные
};

#pragma clang diagnostic pop

/***************************************************************************************************
 *                                         GLOBAL VARIABLES                                        *
 **************************************************************************************************/

extern cpp_rw_params sett_usr;

extern const params_users_t *const &sett_usr_param;

/***************************************************************************************************
 *                                    PUBLIC FUNCTION PROTOTYPES                                   *
 **************************************************************************************************/
