/***************************************************************************************************
 *   Project:
 *   Author:        Stulov Tikhon
 ***************************************************************************************************
 *   Distribution:
 *
 ***************************************************************************************************
 *   MCU Family:    STM32F
 *   Compiler:      ARMCC
 ***************************************************************************************************
 *   File:          cpp_tmr.h
 *   Description:   неблокирующий механизм отсчета временных интервалов
 *
 ***************************************************************************************************
 *   History:       17.12.2019 - file created
 *
 **************************************************************************************************/

#pragma once

/***************************************************************************************************
 *                                      INCLUDED FILES
 **************************************************************************************************/

#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>

#ifdef __cplusplus
    using namespace std;
#endif

/***************************************************************************************************
 *                                    PUBLIC CLASSES
 **************************************************************************************************/

class cpp_tmr
{
protected:
    const uint32_t delay;
    uint32_t timestamp;

public:
    cpp_tmr(const uint32_t _delay); //  онструктор, задает временную уставку
    void reset(void);               // —брос таймера (фиксаци€ времени начала отсчета)
    void inc(void);                 // ƒобавление ко времени ожидани€ интервала, равного уставке
    bool is_ovf(void);              // ѕроверка переполнени€
    void ovf_wait(void);            // ƒождатьс€ переполнени€
};

/***************************************************************************************************
 *                                       END OF FILE
 **************************************************************************************************/
