/***************************************************************************************************
 *   Project:
 *   Author:
 ***************************************************************************************************
 *   Distribution:
 *
 ***************************************************************************************************
 *   MCU Family:    STM32F
 *   Compiler:      ARMCC
 ***************************************************************************************************
 *   File:          bsp_vcp.h
 *   Description:
 *
 ***************************************************************************************************
 *   History:       <30.10.2019> - file created
 *
 **************************************************************************************************/

#pragma once

/***************************************************************************************************
 *                                      INCLUDED FILES
 **************************************************************************************************/

#include "bsp_types.h"

#ifdef __cplusplus
extern "C" {
#endif

/***************************************************************************************************
 *                                       DEFINITIONS
 **************************************************************************************************/

/***************************************************************************************************
 *                                      PUBLIC TYPES
 **************************************************************************************************/

/***************************************************************************************************
 *                                     GLOBAL VARIABLES
 **************************************************************************************************/

/***************************************************************************************************
 *                                PUBLIC FUNCTION PROTOTYPES
 **************************************************************************************************/

/**
 *  @brief     Функция инициализации VCP
 *  @details   Инициализирует USB Device Controller Core, железо USB. Включение PULL-UP на ножках
 *             сигналов D+ и D- (сигнал подключения устройства к шине USB)
 *
 *  @return    Успешность выполнения функции
 */
bsp_result_t bsp_vcp_init();

/**
 *  @brief     Функция де-инициализирует VCP
 *  @details   Создает сигнал отключения от шины USB, де-инициализирует USB Device Controller Core
 *             и железо USB
 *
 *  @return    Успешность выполнения функции
 */
bsp_result_t bsp_vcp_deinit();

/**
 *  @brief     Функция проверки статуса VCP
 *  @details
 *
 *  @return    true - устройство сконфигурировано и готово для коммуникации
 *             false - устройство не сконфигурировано и не готово для коммуникации
 */
bool bsp_vcp_is_configured();

/**
 *  @brief     Функция для считывания байт из входящего буфера
 *  @details
 *
 *  @param[in] Указатель на буфер
 *  @param[in] Кол-во байт для считывания
 *
 *  @return    Кол-во считанных байт. Отрицательное значение возвращается при ошибке
 */
int32_t bsp_vcp_read_data(uint8_t *buf, int32_t len);

/**
 *  @brief     Функция для отправки байт в исходящий буфер
 *  @details
 *
 *  @param[in] Указатель на буфер
 *  @param[in] Кол-во байт для отправки
 *
 *  @return    Кол-во байт отправленных в исходящий буфер. Отрицательное значение возвращается
 *             при ошибке
 */
int32_t bsp_vcp_write_data(const uint8_t *buf, int32_t len);

int bsp_vcp_put_char(int ch);

int bsp_vcp_get_char(void);

#ifdef __cplusplus
} // extern "C"
#endif

/***************************************************************************************************
 *                                       END OF FILE
 **************************************************************************************************/
